mattehicks/SCDE/components/ESP32_SwITCH_Module/ESP32_SwITCH_Module.c
/* #################################################################################################
 *
 *  ESP32_SwITCH Module for SCDE (Smart Connected Device Engine)
 *
 *  SwITCH -> SwITCH Feature.
 *  It is used to drive GPIOs as a switch (on/off/pwm) with the goal to control hardware (Relay,
 *  LED-Controller, Smart Socket, ...). The ESP32 SoC GPIO will be connected to the PWM-Hardware.
 *  The PWM-Hardware is used and controlled by this Module. This is hardware PWM/switching.
 *
 *  Created by Maik Schulze, Sandfuhren 4, 38448 Wolfsburg, Germany for EcSUHA.de 
 *
 *  MSchulze780@GMAIL.COM
 *  Copyright by EcSUHA
 *
 *  EcSUHA - ECONOMIC SURVEILLANCE AND HOME AUTOMATION - WWW.EcSUHA.DE
 * #################################################################################################
 *
 * DIV calculation and allowed freq in HZ: REF=1.000.000hz / APB 80.000.000 hz
 *  clock source (eg. REF 1.000.000) / 16hz / (1<<RESOLUTION (eg.8bit)) = 
 *
 *#define LEDC_APB_CLK_HZ (APB_CLK_FREQ)  // 80.000.000 hz sample: 9765hz / 256bit-res -> divider is 32
 *#define LEDC_REF_CLK_HZ (1*1000000)
 *
 * wenn Timer setup [<TICK_SOURCE=REF|APB_SLOW> & <RESOLUTION=8> & <FREQ_HZ=> ] 
 *
 * HELP-STRINGS:
 * Define <Def-Name> ESP32_SwITCH <GPIO=> <CHANNEL=> <TIMER=> <TICK_SOURCE=REF|APB_SLOW> <RESOLUTION=8> <FREQ_HZ=> <IDLE_LV=> [<SIG_OUT_EN=> <HPOINT=0> <DUTY=0>]
 * Set <Def-Name> <GPIO=> <TICK_SOURCE=> <RESOLUTION=8> <FREQ_HZ=> <SIG_OUT_EN=> <IDLE_LV=> <HPOINT=0> <DUTY=>
 * (not allowed to change by SET: <BLOCK=> <TIMER=> <CHANNEL=> )
 *
 * SAMPLE USAGE :
 * define Switch.1 esp32_SwITCH GPIO=13&BLOCK=High_Speed&CHANNEL=0&TIMER=0&TICK_SOURCE=Low&RESOLUTION=8&FREQ_HZ=9765&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55
 * set Switch.1 DUTY=210
 *
 */

/*
define Switch.2 esp32_SwITCH GPIO=14&BLOCK=High_Speed&CHANNEL=2&TIMER=0&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=9765&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55
define Switch.3 esp32_SwITCH GPIO=15&BLOCK=High_Speed&CHANNEL=3&TIMER=0&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=9765&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55

set Switch.1 esp32_SwITCH GPIO=13&BLOCK=High_Speed&CHANNEL=0&TIMER=0&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=9765&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=1&DUTY=55
set Switch.1 SIG_OUT_EN=Enabled
set Switch.1 SIG_OUT_EN=Disabled

// for test makerfile 8 ch ssr relay
Test: HS ch REF clock
define SSR.1.at.GPIO.13 esp32_SwITCH GPIO=13&BLOCK=High_Speed&CHANNEL=0&TIMER=0&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=16&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55
define SSR.2.at.GPIO.12 esp32_SwITCH GPIO=12&BLOCK=Low_Speed&CHANNEL=0&TIMER=0&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=16&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55
define SSR.3.at.GPIO.14 esp32_SwITCH GPIO=14&BLOCK=High_Speed&CHANNEL=1&TIMER=1&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=16&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55
define SSR.4.at.GPIO.27 esp32_SwITCH GPIO=27&BLOCK=High_Speed&CHANNEL=2&TIMER=1&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=16&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55
define SSR.5.at.GPIO.26 esp32_SwITCH GPIO=26&BLOCK=High_Speed&CHANNEL=3&TIMER=2&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=16&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55
define SSR.6.at.GPIO.25 esp32_SwITCH GPIO=25&BLOCK=High_Speed&CHANNEL=4&TIMER=2&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=16&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55

define SSR.7.at.GPIO.33 esp32_SwITCH GPIO=33&BLOCK=High_Speed&CHANNEL=5&TIMER=2&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=16&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55
define SSR.8.at.GPIO.32 esp32_SwITCH GPIO=32&BLOCK=High_Speed&CHANNEL=6&TIMER=2&TICK_SOURCE=REF&RESOLUTION=8&FREQ_HZ=16&SIG_OUT_EN=Enabled&IDLE_LV=Low&HPOINT=0&DUTY=55

//GPIOs 0, 1, 2, 3, 4, 5, 12, 13, 14, 15, 16, 17, 18 ,19, 21, 22, 23, 25, 26, 27, 32 and 33.
//checked GPIOs OK 0, 12, 13, 14, 25, 26, 27.

set Switch.1 DUTY=1
set Switch.1 DUTY=255

set Switch.1 HPOINT=30&DUTY=100
set Switch.1 IDLE_LV=High
set Switch.1 IDLE_LV=Low
set Switch.1 GPIO=13

set Switch.1 RESOLUTION=8&TICK_SOURCE=REF&DIV_FACTOR=7
set Switch.1 TICK_SOURCE=REF
set Switch.1 DIV_FACTOR=7

*/

#include <ProjectConfig.h>
#include <esp8266.h>
#include <Platform.h>

#include <SCDE_s.h>

#include "ESP32_SwITCH_Module.h"

#include "SCDE_Main.h"



// we are using the hardware counter
//#include "soc/pcnt_reg.h"
//#include "soc/pcnt_struct.h"


#include "driver/gpio.h"

#define LEDC_APB_CLK_HZ (APB_CLK_FREQ)  // 80.000.000 hz sample: 9765hz / 256bit-res -> divider is 32
#define LEDC_REF_CLK_HZ (1*1000000)


// -------------------------------------------------------------------------------------------------

// ammount of debug information 0 = off 5 max?
#ifndef ESP32_SwITCH_DBG
#define ESP32_SwITCH_DBG 0
#endif

// -------------------------------------------------------------------------------------------------

// make data root locally available
static SCDERoot_t* SCDERoot;

// make locally available from data-root: the SCDEFn (Functions / callbacks) for operation
static SCDEFn_t* SCDEFn;

// -------------------------------------------------------------------------------------------------

#include <WebIf_EspFSStdFileTX.h>
#include <WebIf_EspFSAdvFileTX.h>

#include "HTools_cgi.h"
#include <ServAPCfg_tpl.h>
#include <CGI_Redirect.h>



// -------------------------------------------------------------------------------------------------



/*
 * Implemented Values for Keys
 */

// ESP32_SwITCH_SET_SIG_OUT_EN -> 'SIG_OUT_EN' -> Disabled|Enabled
SelectAData ESP32_SwITCH_DisEna[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Disabled"},
  {1,"Enabled"}, 
  {0, NULL}
};

// ESP32_SwITCH_SET_IDLE_LV -> 'IDLE_LV' -> Low|High
SelectAData ESP32_SwITCH_LoHi[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Low"},
  {1,"High"}, 
  {0, NULL}
};

// ESP32_SwITCH_SET_BLOCK -> 'PWM_BLOCK'-> High_Speed|Low_Speed
SelectAData ESP32_SwITCH_PWM_BLOCK[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"High_Speed"},
  {1,"Low_Speed"},
  {0, NULL}
};

