mattehicks/SCDE/components/ESP32_SwITCH_Module/ESP32_SwITCH_Module.c
// ESP32_SwITCH_SET_TICK_SOURCE -> 'TICK_SOURCE'-> REF|APB_SLOW
SelectAData ESP32_SwITCH_TICK_SOURCE[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"REF"},
  {1,"APB_SLOW"}, 
  {0, NULL}
};



/**
 * For Type: ESP32_SwITCH
 * Implemented-Args-Keys, for input (MAX 64!). //IAK!!
 * KEYs-Field-Set for Feature specific query. Will be generated by SCDEH_ParseStrToparsedKVInput()
 * parsed result is stored in ESP32_SwITCH_parsedKVInput_t
 */
enum ESP32_SwITCH_SET_IK {				// Bit #XX for debugging

  // PWM Hardware configuration
    ESP32_SwITCH_SET_ON		= 0			// Bit #00 'ON'  -> 
  , ESP32_SwITCH_SET_OFF				// Bit #01 'OFF'  -> 

  , ESP32_SwITCH_SET_MAX				// Bit #02 'MAX'  -> 
  , ESP32_SwITCH_SET_MIN				// Bit #03 'MIN'  -> 

  , ESP32_SwITCH_SET_VAL				// Bit #04 'VAL'  -> 
  , ESP32_SwITCH_SET_DIM				// Bit #05 'DIM'  -> 

  , ESP32_SwITCH_SET_NAME				// Bit #06 'NAME'  -> 
  , ESP32_SwITCH_SET_CAPS				// Bit #07 'CAPS'  -> 

  // Block #01 PWM configuration
  , ESP32_SwITCH_SET_GPIO				// Bit #08 'GPIO' -> 
  , ESP32_SwITCH_SET_BLOCK				// Bit #09 'BLOCK' -> 
  , ESP32_SwITCH_SET_CHANNEL				// Bit #10 'CHANNEL' -> 
  , ESP32_SwITCH_SET_TIMER				// Bit #11 'TIMER' -> 

  , ESP32_SwITCH_SET_DUTY				// Bit #12 'DUTY' ->
  , ESP32_SwITCH_SET_HPOINT				// Bit #13 'HPOINT' ->
  , ESP32_SwITCH_SET_SIG_OUT_EN				// Bit #14 'SIG_OUT_EN' ->
  , ESP32_SwITCH_SET_IDLE_LV				// Bit #15 'IDLE_LV' ->

  , ESP32_SwITCH_SET_RESOLUTION				// Bit #16 'RESOLUTION' -> 
  , ESP32_SwITCH_SET_TICK_SOURCE			// Bit #17 'TICK_SOURCE' ->
  , ESP32_SwITCH_SET_FREQ_HZ				// Bit #18 'FREQ_HZ' ->

  , ESP32_SwITCH_SET_THR_L_LIM_EN			// Bit #19 'THR_L_LIM_EN' -> DIS/ENA
  , ESP32_SwITCH_SET_THR_H_LIM_EN			// Bit #20 'THR_H_LIM_EN' -> DIS/ENA
  , ESP32_SwITCH_SET_THR_ZERO_EN			// Bit #21 'THR_ZERO_EN' -> DIS/ENA
  , ESP32_SwITCH_SET_FILTER_EN				// Bit #22 'FILTER_EN' -> DIS/ENA
  , ESP32_SwITCH_SET_FILTER_THRES			// Bit #23 'FILTER_THRES' -> decval 10 bit zahl
  , ESP32_SwITCH_SET_CNT_THRES1				// Bit #24 'CNT_THRES1' -> decval 16 bit zahl
  , ESP32_SwITCH_SET_CNT_THRES0				// Bit #25 'CNT_THRES0' -> decval 16 bit zahl
  , ESP32_SwITCH_SET_CNT_L_LIM				// Bit #26 'CNT_L_LIM' -> decval 10 bit zahl
  , ESP32_SwITCH_SET_CNT_H_LIM				// Bit #27 'CNT_H_LIM' -> decval 10 bit zahl

// end marker
  , ESP32_SwITCH_SET_IK_Number_of_keys			// Bit #27 MAX 64 IMPLEMENTED !

};

 

/**
 * For Type: ESP32_SwITCH
 * Implemented readings (MAX 32!)
 * Can be assigned to Implemented Keys, if affected
 */
enum ESP32_SwITCH_Readings {			// Bit #XX for debugging

   ESP32_SwITCH_R_DUTY		= (1<<0)	// Bit #00 'Duty'  -> 

  ,ESP32_SwITCH_R_RESOLUTION	= (1<<1)	// Bit #01 'Resolution' -> 

  ,ESP32_SwITCH_R_NAME		= (1<<2)	// Bit #02 'name' + caps + ufid -> 

};



/**
 * For Type: ESP32_SwITCH
 * Implemented KEYS and assigned readings for this query - analyzed by by http_parser_parse_url()

 * Num should meet enum XX_QueryFields
 * Result is stored in struct SCDE_XX_parsedKVInput
 */
kvParseImplementedKeys_t ESP32_SwITCH_Set_ImplementedKeys[] = {
// |                                                          affected readings										              	|  CMD

// for usage 
   { ESP32_SwITCH_R_DUTY | ESP32_SwITCH_R_RESOLUTION															, "ON" }		// #00
  ,{ ESP32_SwITCH_R_DUTY | ESP32_SwITCH_R_RESOLUTION															, "OFF" }		// #01
  ,{ ESP32_SwITCH_R_DUTY | ESP32_SwITCH_R_RESOLUTION															, "MAX" }		// #02
  ,{ ESP32_SwITCH_R_DUTY | ESP32_SwITCH_R_RESOLUTION															, "MIN" }		// #03
  ,{ ESP32_SwITCH_R_DUTY | ESP32_SwITCH_R_RESOLUTION															, "VAL" }		// #04
  ,{ ESP32_SwITCH_R_DUTY | ESP32_SwITCH_R_RESOLUTION															, "DIM" }		// #05

  ,{ ESP32_SwITCH_R_DUTY | ESP32_SwITCH_R_RESOLUTION | ESP32_SwITCH_R_NAME												, "NAME" }		// #06
  ,{ ESP32_SwITCH_R_DUTY | ESP32_SwITCH_R_RESOLUTION | ESP32_SwITCH_R_NAME												, "CAPS" }		// #07

// for configuration
  ,{ 0																					, "GPIO" }		// #08
  ,{ 0																					, "BLOCK" }		// #09
  ,{ 0																					, "CHANNEL" }		// #10
  ,{ 0																					, "TIMER" }		// #11
  ,{ 0																					, "DUTY" }		// #12
  ,{ 0																					, "HPOINT" }		// #13
  ,{ 0																					, "SIG_OUT_EN" }	// #14
  ,{ 0																					, "IDLE_LV" }		// #15

  ,{ 0																					, "RESOLUTION" }		// #16
  ,{ 0																					, "TICK_SOURCE" }	// #17
  ,{ 0																					, "FREQ_HZ" }		// #18

  ,{ 0																					, "THR_L_LIM_EN" }	// #19
  ,{ 0																					, "THR_H_LIM_EN" }	// #20
  ,{ 0																					, "THR_ZERO_EN" }	// #21
  ,{ 0																					, "FILTER_EN" }		// #22
  ,{ 0																					, "FILTER_THRES" }	// #23
  ,{ 0																					, "CNT_THRES1" }	// #24
  ,{ 0																					, "CNT_THRES0" }	// #25
  ,{ 0																					, "CNT_L_LIM" }		// #26
  ,{ 0																					, "CNT_H_LIM" }		// #27

}; // number of elements should be equal with XX_SET_IK_Number_of_keys, LIMIT IS 64 ELEMENTS !





/*"WSAP_Password ";
	$list .= "WSAP_RF_Channel:uzsuSelectRadio,1,2,3,4,5,6,7,8,9,10,11,12,13 ";

"WSAP_Beacon_Interval:slider,100,10,60000 ";

uint8Slider,a,b,c

uint16Slider,a,b,c
uint32Slider,a,b,c
int8Slider,a,b,c
int16Slider,a,b,c
int32Slider,a,b,c

*/



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: ESP32_SwITCH_ActiveResourcesDataA_forWebIf
 *  Desc: Resource-Content-structure of active Directory - PART A (Resource-Data-Row)
 *  Data: WebIf_ActiveResourcesDataA_t[X] from HttpD.h
 * -------------------------------------------------------------------------------------------------
 */
// Content:   AllowedMethodBF          | AllowedDocMimeBF  | AllowedSchemeBF |free|CgiNo| EnaByBit | Url
const WebIf_ActiveResourcesDataA_t ESP32_SwITCH_ActiveResourcesDataA_forWebIf[] = {  //ICACHE_RODATA_ATTR = 

  // SOC Hardware Cfg
  { 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  0, 0b00000000, "/SoCHWCfg"}

  // WiFi Stations Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  1, 0b00000000, "/WiFi/StationCfg"}

  // WIFI Q-Connect PAGES
 ,{ 0b00000000000000000000000000001010, 0b0000000000000010, 0b0000000000000001,  0,  2, 0b00000000, "/WiFi/QConnect"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000001000, 0b0000000000000001,  0,  3, 0b00000000, "/WiFi/WiFiScan"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000000100, 0b0000000000000001,  0,  4, 0b00000000, "/WiFi/Connect"}
 ,{ 0b00000000000000000000000000001010, 0b0000000000000100, 0b0000000000000001,  0,  5, 0b00000000, "/WiFi/Setmode"}

  // Service Access Point Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  6, 0b00000000, "/WiFi/ServAPCfg"}

  // TimeStamp Cfg
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  7, 0b00000000, "/TiStCfg"}

  // Firmware Update
 ,{ 0b00000000000000000000000000001010, 0b0000000000001110, 0b0000000000000001,  0,  8, 0b00000000, "/Firmware"}

  // Redirects
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0,  9, 0b00000000, "/WiFi"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0,  9, 0b00000000, "/WiFi/"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000001, 0b0000000000000001,  0, 10, 0b00000000, "/"}	// nomime
 ,{ 0b00000000000000000000000000001010, 0b0000000000000010, 0b0000000000000001,  0, 10, 0b00000000, "/index"}	// .htm

