mattehicks/SCDE/components/ESP32_SwITCH_Module/ESP32_SwITCH_Module.c
  printf("ESP32_SwITCH_AttributeFN for defName:%.*s -> attrCmd:%.*s attrName:%.*s attrVal:%.*s\n"
	,Common_Definition->nameLen
	,Common_Definition->name
	,attrCmdTextLen
	,attrCmdText
  	,attrNameTextLen
	,attrNameText
	,(int) attrValTextLen
	,attrValText);



/*
  // set start of possible def-Name
  const uint8_t *defName = args;

  // set start of possible attr-Name
  const uint8_t *attrName = args;

  // a seek-counter

  int i = 0;

  // seek to next space !'\32'
  while( (i < argsLen) && (*attrName != ' ') ) {i++;attrName++;}

  // length of def-Name
  size_t defNameLen = i;

  // seek to start position of attr-Name '\32'
  while( (i < argsLen) && (*attrName == ' ') ) {i++;attrName++;}

  // set start of possible attr-Val
  const uint8_t *attrVal = attrName;

  // a 2nd seek-counter
  int j = 0;

  // seek to next space !'\32'
  while( (i < argsLen) && (*attrVal != ' ') ) {i++,j++;attrVal++;}

  // length of attr-Name
  size_t attrNameLen = j;

  // start position of attr-Val
  while( (i < argsLen) && (*attrVal == ' ') ) {i++;attrVal++;}


  // length of attr-Val
  size_t attrValLen = argsLen - i;

  // veryfy lengths > 0, definition 0 allowed
  if ( (defNameLen == 0) || (attrNameLen == 0) )

		{

		// response with error text
		asprintf(&retMsg
				,"Could not interpret command ''! Usage: Attr <defname> <attrname> [<attrval>]");

		return retMsg;

	//	}

// -------------------------------------------------------------------------------------------------
*/

  return retMsg;

}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_SwITCH_Define
 *  Desc: Finalizes the defines a new "device" of 'ESP32_S0' type. Contains devicespecific init code.
 *  Info: 
 *  Para: Common_Definition_t *Common_Definition -> prefilled ESP32Control Definition
 *        char *Definition -> the last part of the CommandDefine arg* 
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR 
ESP32_SwITCH_Define(Common_Definition_t *Common_Definition)
//	,uint8_t *defArgsText
//	,size_t defArgsTextLen)
{

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  ESP32_SwITCH_Definition_t* ESP32_SwITCH_Definition =
		  (ESP32_SwITCH_Definition_t*) Common_Definition;
/*
  #if ESP32_SwITCH_DBG >= 5
  printf("\n|ESP32_SwITCH_Def, Def:%.*s>"
	,ESP32_SwITCH_Definition->common.definitionLen
	,ESP32_SwITCH_Definition->common.definition);
  #endif
*/
  // new conversation
  uint8_t *defArgsText = Common_Definition->definition;
  size_t defArgsTextLen = Common_Definition->definitionLen;

  #if ESP32_SwITCH_DBG >= 5
  printf("\n|ESP32_SwITCH_Def, Name:%.*s, got args:%.*s>"
	,ESP32_SwITCH_Definition->common.nameLen
	,ESP32_SwITCH_Definition->common.name
	,defArgsTextLen
	,defArgsText);
  #endif

// ------------------------------------------------------------------------------------------------

  // Check for args. This type requires args...
  if (!defArgsTextLen) {

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Parsing Error! Expected Args!");

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // store FD to Definition. Will than be processed in global loop ... -> THIS MODULE USES NO FD
  ESP32_SwITCH_Definition->common.fd = -1;

// ------------------------------------------------------------------------------------------------

  // init WebIf_Provided offset
//  ESP32Control_Definition->common.link =
//	&ESP32Control_Definition->WebIf_Provided;

  // check for loaded Module 'WebIf' -> get provided Fn
  ESP32_SwITCH_Definition->WebIf_Provided.WebIf_FnProvided =
	NULL;//(WebIf_FnProvided_t *) SCDEFn->GetFnProvidedByModule("WebIf");

 // Providing data for WebIf? Initialise data provided for WebIf
  if (ESP32_SwITCH_Definition->WebIf_Provided.WebIf_FnProvided) {

	ESP32_SwITCH_Definition->WebIf_Provided.ActiveResourcesDataA =
		(WebIf_ActiveResourcesDataA_t *) &ESP32_SwITCH_ActiveResourcesDataA_forWebIf;

	ESP32_SwITCH_Definition->WebIf_Provided.ActiveResourcesDataB =
		(WebIf_ActiveResourcesDataB_t *) &ESP32_SwITCH_ActiveResourcesDataB_forWebIf;

	}

  else	{

	SCDEFn->Log3Fn(Common_Definition->name
		,Common_Definition->nameLen
		,1
		,"Could not enable WebIf support for '%.*s'. Type '%.*s' detects Type 'WebIf' is NOT loaded!"
		,ESP32_SwITCH_Definition->common.nameLen
		,ESP32_SwITCH_Definition->common.name
		,ESP32_SwITCH_Definition->common.module->ProvidedByModule->typeNameLen
		,ESP32_SwITCH_Definition->common.module->ProvidedByModule->typeName);
	}

// ------------------------------------------------------------------------------------------------

  // Parse define-args (KEY=VALUE) protocol -> gets parsedKVInput in allocated mem, NULL = ERROR
  parsedKVInputArgs_t *parsedKVInput = 
	SCDEFn->ParseKVInputArgsFn(ESP32_SwITCH_SET_IK_Number_of_keys	// Num Implementated KEYs MAX
	,ESP32_SwITCH_Set_ImplementedKeys		// Implementated Keys
	,defArgsText				// our args text
	,defArgsTextLen);			// our args text len

  // parsing may report an problem. args contain: unknown keys, double keys, ...?
  if (!parsedKVInput) {

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Parsing Error! Args '%.*s' not taken! Check the KEYs!"
		,defArgsTextLen
		,defArgsText);

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------









/*

In file included from /home/maikschulze/esp/esp-idf/components/soc/esp32/include/soc/dport_reg.h:20:0,
                 from /home/maikschulze/esp/esp-idf/components/driver/include/driver/periph_ctrl.h:19,
                 from /home/maikschulze/esp/SCDE/components/ESP32_SwITCH_Module/./ESP32_SwITCH_Module.c:701:
/home/maikschulze/esp/esp-idf/components/soc/esp32/include/soc/dport_access.h: In function 'ESP32_SwITCH_Define':
/home/maikschulze/esp/esp-idf/components/soc/esp32/include/soc/dport_access.h:43:34: error: invalid storage class for function 'DPORT_REG_READ'
 static inline uint32_t IRAM_ATTR DPORT_REG_READ(uint32_t reg)
*/


//#include "soc/dport_reg.h"

//#include "driver/periph_ctrl.h"
//#include "soc/dport_reg.h"


//#include "driver/gpio.h"
//#include "driver/pcnt.h"


//#include "esp_attr.h"
//#include "esp_log.h"
//#include "soc/gpio_sig_map.h"


//esp_err_t pcnt_set_pin(pcnt_unit_t unit, pcnt_channel_t channel, int pulse_io, int ctrl_io)


