mattehicks/SCDE/components/ESP32_SwITCH_Module/ESP32_SwITCH_Module.c
/*
In file included from /home/maikschulze/esp/esp-idf/components/soc/esp32/include/soc/dport_reg.h:20:0,
                 from /home/maikschulze/esp/esp-idf/components/driver/include/driver/periph_ctrl.h:19,
                 from /home/maikschulze/esp/SCDE/components/ESP32_SwITCH_Module/./ESP32_SwITCH_Module.c:707:
/home/maikschulze/esp/esp-idf/components/soc/esp32/include/soc/dport_access.h: In function 'ESP32_SwITCH_Define':
/home/maikschulze/esp/esp-idf/components/soc/esp32/include/soc/dport_access.h:43:34: error: invalid storage class for function 'DPORT_REG_READ'
 static inline uint32_t IRAM_ATTR DPORT_REG_READ(uint32_t reg)
  */



  // enable the PWM (LED-Controller)
 // DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG, DPORT_LEDC_CLK_EN);
 // DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_LEDC_RST);
//x    DPORT_SET_PERI_REG_MASK(DPORT_PERIP_CLK_EN_REG,DPORT_LEDC_CLK_EN);
//x   DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_LEDC_RST);




/*

  #if ESP32_SwITCH_DBG >= 5

  printf("\n|ESP32_SwITCH_Def, installed pulseIO:%d ctrlIO:%d PCNT_CTRL_REG:%u>"

	,pulse_io

	,ctrl_io
	,*xREG);
  #endif
*/



 //clr pause
// uint32_t *xREG = 0x3FF570b0;
// *xREG &= ~(1 << 1);


































// ------------------------------------------------------------------------------------------------

  // set required Keys -> Keys that should be there in this request
  parsedKVInput->requiredKVBF = ( (1 << ESP32_SwITCH_SET_GPIO)
			        | (1 << ESP32_SwITCH_SET_BLOCK)
			        | (1 << ESP32_SwITCH_SET_CHANNEL)
			        | (1 << ESP32_SwITCH_SET_TIMER)
			        | (1 << ESP32_SwITCH_SET_DUTY)
			        | (1 << ESP32_SwITCH_SET_HPOINT)
			        | (1 << ESP32_SwITCH_SET_SIG_OUT_EN)
			        | (1 << ESP32_SwITCH_SET_IDLE_LV)
			        | (1 << ESP32_SwITCH_SET_RESOLUTION)
			        | (1 << ESP32_SwITCH_SET_TICK_SOURCE)
			        | (1 << ESP32_SwITCH_SET_FREQ_HZ) );

  // set forbidden Keys -> Keys that are not allowed in this request
  parsedKVInput->forbiddenKVBF = 0;

  // process the set-args (key=value@) protocol
  if (ESP32_SwITCH_ProcessKVInputArgs(ESP32_SwITCH_Definition
	,parsedKVInput				// KVInput parsed
	,defArgsText				// our args text
	,defArgsTextLen) ) {			// our args text len

 	// Processing reports an problem. Args not taken. Response with error text.

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Processing Error! Args '%.*s' not taken! Check the VALUEs!"
		,defArgsTextLen
		,defArgsText);

	// free allocated memory for query result key-field
	free(parsedKVInput);

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // set affected readings
  ESP32_SwITCH_SetAffectedReadings(ESP32_SwITCH_Definition
	,parsedKVInput->affectedReadingsBF);

// ---------------------

  // free allocated memory for query result key-field
  free(parsedKVInput);

//  return retMsg;

//}

// ------------------------------------------------------------------------------------------------







  // set up 1st idle Callback
  ESP32_SwITCH_Definition->common.Common_CtrlRegA |= F_WANTS_IDLE_TASK;





/*
  #if ESP32_SwITCH_DBG >= 5

  printf("\n|ESP32_SwITCH_Def, installed pulseIO:%d ctrlIO:%d PCNT_CTRL_REG:%u>"

	,pulse_io

	,ctrl_io
	,*xREG);
  #endif
*/

  return retMsg;

}



/*
 * ------------------------------------------------------------------------------------------------
 *  FName: ESP32_SwITCH_IdleCb	
 *  Desc: Timed callback, X Hz, to do type dependend processing tasks.
 *  Info: 
 *  Para: Common_Definition_t *Common_Definition -> prefilled WebIf Definition 
 *  Rets: ? unclear char* -> response text NULL=no text
 * ------------------------------------------------------------------------------------------------
 */
int //feedModuleTask
ESP32_SwITCH_IdleCb(Common_Definition_t *Common_Definition)
{

  // make common ptr to modul specific ptr
  ESP32_SwITCH_Definition_t* ESP32_SwITCH_Definition =
		  (ESP32_SwITCH_Definition_t*) Common_Definition;

  #if ESP32_SwITCH_DBG >= 5
  printf("\n|ESP32_SwITCH_IdleCb, Def:%.*s>"
	,ESP32_SwITCH_Definition->common.nameLen
	,ESP32_SwITCH_Definition->common.name);
  #endif

// -------------------------------------------------------------------------------------------



  // build pointer to make the hardware counter accessible
  ESP32_PWM_Channel_t *pPWM_Channel =
	(ESP32_PWM_Channel_t*) (0x3FF59000 + (0x14 * ESP32_SwITCH_Definition->Channel));

  // access low speed channels (instead of high speed channels)?
  if (ESP32_SwITCH_Definition->Block) pPWM_Channel =
	(ESP32_PWM_Channel_t*) ( (uint8_t*) pPWM_Channel + 0xa0);


  // build pointer to make the hardware timer accessible
  ESP32_PWM_Timer_t *pPWM_Timer =
	(ESP32_PWM_Timer_t*) (0x3FF59140 + (0x08 * ESP32_SwITCH_Definition->Timer));

  // access low speed timers (instead of high speed timers)?
  if (ESP32_SwITCH_Definition->Block) pPWM_Timer =
	(ESP32_PWM_Timer_t*) ( (uint8_t*) pPWM_Timer + 0x20);

/*
  printf("|STATUS: A:%u, B:%u>"
	,pPWM_Timer->LEDC_HSTIMER_CNT
	,pPWM_Channel->DUTY_CYCLEX);
*/

/*
  // build ptr to access hw-counter
  ESP32_SwITCH_CNT_CNT_REG_t *pESP32_SwITCH_CNT_CNT_REG =
	(ESP32_SwITCH_CNT_CNT_REG_t*) 0x3FF57060;

  printf("|STATUS: Using ctr-unit:%u, old HW-Ctr:%d, new ATT:%u, gpio:%u>"
	,ESP32_SwITCH_Definition->counterUnit
	,pESP32_SwITCH_CNT_CNT_REG[ESP32_SwITCH_Definition->counterUnit].CNT_PULS_CNT
	,ESP32_SwITCH_Definition->ATTShiftBuf[0]
	,gpio_get_level(22) ); //=att ?


  ESP32_SwITCH_CNT_CONF_REG_t *pESP32_SwITCH_CNT_CONF_REG = (ESP32_SwITCH_CNT_CONF_REG_t*) 0x3FF57000;

	SCDEFn->HexDumpOutFn ("verify:"
		,&pESP32_SwITCH_CNT_CONF_REG[0]
		, 0x80);  //sizeof(0x80) ); //ESP32_SwITCH_CNT_CONF_REG_t) );
*/
/*
 if (WebIf_Definition->reverse) {


  // get assigned HTTPD-Connection-Slot-Data
  WebIf_HTTPDConnSlotData_t *conn
	= WebIf_Definition->reverse;

  // execute disconnection (indicated by NEEDS_CLOSE flag) or send more data ...
  if (conn->ConnCtrlFlags & F_GENERATE_IDLE_CALLBACK)

	{

	// execute Idle Callback
	WebIf_IdleCb(WebIf_Definition);

