mattehicks/SCDE/components/ESP32_SwITCH_Module/ESP32_SwITCH_Module.c
	// valid input happened ?
	if (SCDEH_GetQueryKeyID((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_CH1_HCTRL_MODE].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_CH1_HCTRL_MODE].len, &NewMode, ESP32_SwITCH_CTRL_MODE) ) {

		// store ne value
		ESP32_SwITCH_CNT_CONF_REG.CNT_CH1_LCTRL_MODE = NewMode;


		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");


		}

	// invalid input detected ?
	else return true;
  }
*/
//> ------------------------------------------------------------------------------------------------
/*
  // CH1_POS_MODE=no_effect|inc_counter|dec_counter
  // -> ?? Setzt den Hardware-Counter des ESP32 (0-7) der verwendet werden soll
  // -> ?? Sets the hardware counter of the ESP32 (0-7) that should be used
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SwITCH_SET_CH1_POS_MODE) ) {

	uint8_t NewMode;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_CH1_POS_MODE].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_CH1_POS_MODE].len, &NewMode, ESP32_SwITCH_CH_MODE) ) {

		// store ne value
		ESP32_SwITCH_CNT_CONF_REG.CNT_CH1_POS_MODE = NewMode;


		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");


		}

	// invalid input detected ?
	else return true;
  }
*/







// ------------------------------------------------------------------------------------------------

  // GPIO=[0-9]
  // -> Verbindet den PWM-Kanal mit dem angegebenen GPIO (inklusive der Konfiguration)
  // -> Connects the PWM-Channel with the given GPIO (including the setup)
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SwITCH_SET_GPIO) ) {

	// valid input happened ?
	if (SCDEH_GetDecUInt8Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_GPIO].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_GPIO].len, &newGPIO)
		&& (newGPIO <= 33) ) {
/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

// ------------------------------------------------------------------------------------------------

  // DUTY=[0-9]
  // -> Setzt die Leistung der PWM für den zugewiesenen Kanal
  // -> Sets the duty of the PWM for the assigned channel
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SwITCH_SET_DUTY) ) {

	uint32_t newDuty;

	// valid input happened ?
	if (SCDEH_GetDecUInt32Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_DUTY].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_DUTY].len, &newDuty)
		&& (newDuty <= 0b111111111111111111111) ) {

		// store ne value
		newPWM_Channel.DUTY = newDuty;

/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

// ------------------------------------------------------------------------------------------------

  // PWM_HPOINT=[0-9]
  // -> Setzt den Einschaltpunkt (High-Level-Point) der PWM für den zugewiesenen Kanal
  // -> Sets the switch-on-point (High-Level-Point) for the assigned channel
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SwITCH_SET_HPOINT) ) {

	uint32_t newHPoint;

	// valid input happened ?
	if (SCDEH_GetDecUInt32Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_HPOINT].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_HPOINT].len, &newHPoint)
		&& (newHPoint <= 0b11111111111111111111) ) {

		// store ne value
		newPWM_Channel.HPOINT = newHPoint;

/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

// ------------------------------------------------------------------------------------------------

  // SIG_OUT_EN=Disabled|Enabled
  // -> Verbindet / schaltete das PWM Signal auf den Ausgang (GPIO) durch. 
  // -> Connects / switches the PWM Signal through the output GPIO
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SwITCH_SET_SIG_OUT_EN) ) {

