mattehicks/SCDE/components/ESP32_SwITCH_Module/ESP32_SwITCH_Module.c
	uint8_t newSigOutEn;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_SIG_OUT_EN].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_SIG_OUT_EN].len, &newSigOutEn, ESP32_SwITCH_DisEna) ) {

		// store ne value
		newPWM_Channel.SIG_OUT_EN = newSigOutEn;

/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

// ------------------------------------------------------------------------------------------------

  // IDLE_LV=Low|High
  // -> Bestimmt den Ausgangspegel am GPIO (Low|High) wenn SIG_OUT_EN=Disabled
  // -> Defines the output level at the GPIO (Low|High) when SIG_OUT_EN=Disabled
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SwITCH_SET_IDLE_LV) ) {

	uint8_t newIdleLv;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_IDLE_LV].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_IDLE_LV].len, &newIdleLv, ESP32_SwITCH_LoHi) ) {

		// store ne value
		newPWM_Channel.IDLE_LV = newIdleLv;

/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

// ------------------------------------------------------------------------------------------------

  // RESOLUTION=[0-9]
  // -> Setzt die Bitbreite (max 20 Bit) des PWM Timers
  // -> Sets the Bit length (max 20 Bit) of the PWM timer
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SwITCH_SET_RESOLUTION) ) {

	uint8_t newTimerLim;

	// valid input happened ?
	if (SCDEH_GetDecUInt8Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_RESOLUTION].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_RESOLUTION].len, &newTimerLim)
		&& (newTimerLim <= 20) ) {

		// store ne value
		newPWM_Timer.RESOLUTION = newTimerLim;

		// store ne value
//		ESP32_SwITCH_CNT_CONF_REG.CNT_THR_THRES1_EN = NewMode;

/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

// ------------------------------------------------------------------------------------------------

  // TICK_SOURCE=REF|APB_SLOW
  // -> Selektiert den Takterzeuger 0: REF_TICK / 1: APB_CLK
  // -> Selects the clock source 0: REF_TICK / 1: APB_CLK 
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SwITCH_SET_TICK_SOURCE) ) {

	uint8_t newTickSelTimer;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_TICK_SOURCE].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_TICK_SOURCE].len, &newTickSelTimer, ESP32_SwITCH_TICK_SOURCE) ) {

		// store ne value
		newPWM_Timer.TICK_SOURCE = newTickSelTimer;

/*
		// save new value, from input
		SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].ATTShiftBuf[0]
			= NewVal;

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// mark affected readings for TX
		affectedReadings |= QueryResultKF->KeyField_Data_t[S0_QF_att].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MyS0_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf(RespArgsWPos,"cmd=att");

*/
		}

	// invalid input detected ?
	else return true;
  }

// ------------------------------------------------------------------------------------------------

  // FREQ_HZ=[0-9]	// NOTE: clc bases on .RESOLUTION, .TICK_SOURCE !! (should be parsed here)
  // -> Konfiguriert den Divisionsfaktor
  // -> Configures the division factor for the divider in high-speed timer from given frequency in HZ
  if (parsedKVInput->keysFoundBF & ( (uint64_t) 1 << ESP32_SwITCH_SET_FREQ_HZ) ) {

	uint32_t newFreqHz;

	// valid input happened ?
	if (SCDEH_GetDecUInt32Val((uint8_t*) argsText + parsedKVInput->keyData_t[ESP32_SwITCH_SET_FREQ_HZ].off
		,parsedKVInput->keyData_t[ESP32_SwITCH_SET_FREQ_HZ].len, &newFreqHz) ) {

		// calculate new divider value
		uint32_t divNum = 0;

		// get the choosen precision
		uint32_t precision = ( 0x1 << newPWM_Timer.RESOLUTION );

		// used timer -> 1: APB_CLK or SLOW_CLK / 0: REF_TICK
		if (newPWM_Timer.TICK_SOURCE) {

			if (newBlock) {

				// low speed block 1 -> clc for SLOW_CLK
				divNum = ( (uint64_t) LEDC_APB_CLK_HZ << 8 ) / newFreqHz / precision;		

			}

			else {

				// high speed block 0 -> clc for APB_CLK
				divNum = ( (uint64_t) LEDC_APB_CLK_HZ << 8 ) / newFreqHz / precision;		

